#Область ПрограммныйИнтерфейс

// добавление поля Контактное лицо в документы

Процедура Дополнитьформу(Форма) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда 
		ДобавитьГруппаПроценты(Форма);
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
		ДобавитьПолеСогласованнаяСкидкаВГруппаШапкаПраво(Форма);
		ДобавитьКомандуВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаформуПередОснование(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаформуПередСуммаДокумента(Форма);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ДобавитьГруппаПроценты(Форма) Экспорт
	
	ГруппаПроценты = Форма.Элементы.Вставить ("ГруппаПроценты", Тип("ГруппаФормы"), Форма.Элементы.ГруппаШапкаЛево); 
	ГруппаПроценты.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаПроценты.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
	ГруппаПроценты.ОтображатьЗаголовок = Ложь;

КонецПроцедуры

Процедура ДобавитьПолеСогласованнаяСкидкаВГруппаШапкаПраво(Форма) Экспорт
	
	ПолеВвода = Форма.Элементы.Добавить ("СогласованнаяСкидка", Тип("Полеформы"), Форма.Элементы.ГруппаПроценты);
	ПолеВвода.Вид = ВидПоляформы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.СогласованнаяСкидка"; 
	ПолеВвода.УстановитьДействие("ПриИзменении", "СогласованнаяСкидкаПриИзменении");
	
КонецПроцедуры

Процедура ДобавитьКомандуВГруппаШапкаПраво(Форма) Экспорт
	
	Команда = Форма.Команды.Добавить("ПересчитатьТаблицу");
	Команда.Действие = "ПересчитатьТаблицу";
	Команда.Заголовок = "Пересчитать таблицу";
	Кнопка = Форма.Элементы.Добавить("ПересчитатьТаблицу", Тип("КнопкаФормы"), Форма.Элементы.ГруппаПроценты);
	Кнопка.ИмяКоманды = "ПересчитатьТаблицу";
	Кнопка.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	
КонецПроцедуры

Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма) Экспорт
	
	ПолеВвода = Форма.Элементы.Добавить ("КонтактныеЛица", Тип("Полеформы"), Форма.Элементы.ГруппаШапкаПраво);
	ПолеВвода.Вид = ВидПоляформы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.КонтактноеЛицо";
	
КонецПроцедуры 

Процедура ВставитьПолеКонтактноеЛицоНаформуПередСуммаДокумента(Форма) Экспорт
	
	ПолеВвода = Форма.Элементы.Вставить ("КонтактныеЛица", Тип("Полеформы"), , Форма.Элементы.СуммаДокумента);
	ПолеВвода.Вид = ВидПоляформы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.КонтактноеЛицо";
	
КонецПроцедуры

Процедура ВставитьПолеКонтактноеЛицоНаформуПередОснование(Форма) Экспорт
	
	ПолеВвода = Форма.Элементы.Вставить ("КонтактныеЛица", Тип("Полеформы"), , Форма.Элементы.Основание);
	ПолеВвода.Вид = ВидПоляформы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.КонтактноеЛицо";
	
КонецПроцедуры



	
#КонецОбласти
